; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-6-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-3 - location
	p0-6 - location
	p1-7 - location
	p2-0 - location
	p3-5 - location
	p3-6 - location
	p3-10 - location
	p4-7 - location
	p4-9 - location
	p4-10 - location
	p4-11 - location
	p5-4 - location
	p5-8 - location
	p5-12 - location
	p7-3 - location
	p8-11 - location
	p9-2 - location
	p9-10 - location
	p11-0 - location
	p11-1 - location
	p11-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s12)
	(at driver3 s11)
	(at driver4 s3)
	(at driver5 s9)
	(at truck1 s11)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s11)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s10)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s8)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s2)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s8)
	(at package2 s9)
	(at package3 s7)
	(at package4 s2)
	(at package5 s2)
	(at package6 s10)
	(at package7 s12)
	(at package8 s1)
	(at package9 s5)
	(at package10 s12)
	(at package11 s1)
	(at package12 s6)
	(at package13 s7)
	(at package14 s9)
	(at package15 s9)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s5 p5-12)
	(path p5-12 s5)
	(path s12 p5-12)
	(path p5-12 s12)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(path s11 p11-0)
	(path p11-0 s11)
	(path s0 p11-0)
	(path p11-0 s0)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 52)
	(= (time-to-drive s2 s0) 52)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 26)
	(= (time-to-drive s7 s0) 26)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 16)
	(= (time-to-drive s10 s0) 16)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 6)
	(= (time-to-drive s0 s1) 6)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 55)
	(= (time-to-drive s10 s1) 55)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 79)
	(= (time-to-drive s12 s1) 79)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 13)
	(= (time-to-drive s5 s2) 13)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 7)
	(= (time-to-drive s9 s2) 7)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 93)
	(= (time-to-drive s6 s3) 93)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 46)
	(= (time-to-drive s9 s3) 46)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 81)
	(= (time-to-drive s10 s3) 81)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 65)
	(= (time-to-drive s4 s5) 65)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 66)
	(= (time-to-drive s11 s5) 66)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 5)
	(= (time-to-drive s2 s6) 5)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 14)
	(= (time-to-drive s11 s6) 14)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 94)
	(= (time-to-drive s1 s7) 94)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 80)
	(= (time-to-drive s6 s7) 80)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 39)
	(= (time-to-drive s9 s7) 39)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 55)
	(= (time-to-drive s11 s7) 55)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 97)
	(= (time-to-drive s1 s9) 97)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 1)
	(= (time-to-drive s5 s9) 1)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 24)
	(= (time-to-drive s8 s9) 24)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 90)
	(= (time-to-drive s2 s10) 90)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 71)
	(= (time-to-drive s4 s10) 71)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 2)
	(= (time-to-drive s5 s10) 2)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 78)
	(= (time-to-drive s7 s10) 78)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 59)
	(= (time-to-drive s12 s10) 59)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 100)
	(= (time-to-drive s1 s11) 100)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 63)
	(= (time-to-drive s12 s11) 63)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 68)
	(= (time-to-drive s3 s12) 68)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 59)
	(= (time-to-drive s6 s12) 59)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s7)
	(at driver3 s8)
	(at driver4 s1)
	(at truck1 s8)
	(at truck4 s11)
	(at truck5 s12)
	(at package1 s1)
	(at package2 s12)
	(at package3 s3)
	(at package4 s0)
	(at package5 s11)
	(at package6 s4)
	(at package7 s2)
	(at package9 s8)
	(at package10 s11)
	(at package11 s6)
	(at package12 s3)
	(at package13 s11)
	(at package14 s1)
	(at package15 s4)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver3 s11 p8-11)
   deleted: (at driver3 s11)
   added: (at driver3 p8-11)
   goals met: 0 of 20
2. (board-truck driver1 truck6 s2)
   deleted: (at driver1 s2) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 0 of 20
3. (load-truck package4 truck6 s2)
   deleted: (at package4 s2)
   added: (in package4 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 0 of 20
4. (load-truck package5 truck6 s2)
   deleted: (at package5 s2)
   added: (in package5 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 0 of 20
5. (drive-truck truck6 s2 s0 driver1)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   changed: (fuel-used) from 0 to 676
   goals met: 0 of 20
6. (unload-truck package4 truck6 s0)
   deleted: (in package4 truck6)
   added: (at package4 s0)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 1 of 20
7. (walk driver4 s3 p3-5)
   deleted: (at driver4 s3)
   added: (at driver4 p3-5)
   goals met: 1 of 20
8. (drive-truck truck6 s0 s10 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s10)
   changed: (fuel-used) from 676 to 852
   goals met: 1 of 20
9. (load-truck package1 truck5 s8)
   deleted: (at package1 s8)
   added: (in package1 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 1 of 20
10. (walk driver3 p8-11 s8)
   deleted: (at driver3 p8-11)
   added: (at driver3 s8)
   goals met: 2 of 20
11. (load-truck package6 truck6 s10)
   deleted: (at package6 s10)
   added: (in package6 truck6)
   changed: (load truck6) from 1 to 2, (fuel-per-minute truck6) from 11 to 13
   goals met: 2 of 20
12. (walk driver5 s9 p9-10)
   deleted: (at driver5 s9)
   added: (at driver5 p9-10)
   goals met: 2 of 20
13. (drive-truck truck6 s10 s12 driver1)
   deleted: (at truck6 s10)
   added: (at truck6 s12)
   changed: (fuel-used) from 852 to 1619
   goals met: 2 of 20
14. (drive-truck truck6 s12 s11 driver1)
   deleted: (at truck6 s12)
   added: (at truck6 s11)
   changed: (fuel-used) from 1619 to 2438
   goals met: 2 of 20
15. (board-truck driver3 truck5 s8)
   deleted: (at driver3 s8) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 1 of 20
16. (walk driver5 p9-10 s10)
   deleted: (at driver5 p9-10)
   added: (at driver5 s10)
   goals met: 1 of 20
17. (board-truck driver5 truck4 s10)
   deleted: (at driver5 s10) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 1 of 20
18. (walk driver4 p3-5 s5)
   deleted: (at driver4 p3-5)
   added: (at driver4 s5)
   goals met: 1 of 20
19. (drive-truck truck5 s8 s9 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s9)
   changed: (fuel-used) from 2438 to 2702
   goals met: 1 of 20
20. (load-truck package2 truck5 s9)
   deleted: (at package2 s9)
   added: (in package2 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 1 of 20
21. (load-truck package14 truck5 s9)
   deleted: (at package14 s9)
   added: (in package14 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 1 of 20
22. (load-truck package15 truck5 s9)
   deleted: (at package15 s9)
   added: (in package15 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 1 of 20
23. (disembark-truck driver1 truck6 s11)
   deleted: (driving driver1 truck6)
   added: (at driver1 s11) (empty truck6)
   goals met: 1 of 20
24. (board-truck driver1 truck1 s11)
   deleted: (at driver1 s11) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 20
25. (unload-truck package5 truck6 s11)
   deleted: (in package5 truck6)
   added: (at package5 s11)
   changed: (load truck6) from 2 to 1, (fuel-per-minute truck6) from 13 to 11
   goals met: 2 of 20
26. (drive-truck truck4 s10 s12 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s12)
   changed: (fuel-used) from 2702 to 3292
   goals met: 2 of 20
27. (load-truck package10 truck4 s12)
   deleted: (at package10 s12)
   added: (in package10 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 20
28. (unload-truck package6 truck6 s11)
   deleted: (in package6 truck6)
   added: (at package6 s11)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 2 of 20
29. (drive-truck truck4 s12 s11 driver5)
   deleted: (at truck4 s12)
   added: (at truck4 s11)
   changed: (fuel-used) from 3292 to 3985
   goals met: 3 of 20
30. (load-truck package6 truck1 s11)
   deleted: (at package6 s11)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 20
31. (unload-truck package10 truck4 s11)
   deleted: (in package10 truck4)
   added: (at package10 s11)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 4 of 20
32. (drive-truck truck5 s9 s1 driver3)
   deleted: (at truck5 s9)
   added: (at truck5 s1)
   changed: (fuel-used) from 3985 to 5925
   goals met: 4 of 20
33. (unload-truck package1 truck5 s1)
   deleted: (in package1 truck5)
   added: (at package1 s1)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 5 of 20
34. (unload-truck package14 truck5 s1)
   deleted: (in package14 truck5)
   added: (at package14 s1)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 6 of 20
35. (drive-truck truck1 s11 s5 driver1)
   deleted: (at truck1 s11)
   added: (at truck1 s5)
   changed: (fuel-used) from 5925 to 6651
   goals met: 6 of 20
36. (drive-truck truck4 s11 s6 driver5)
   deleted: (at truck4 s11)
   added: (at truck4 s6)
   changed: (fuel-used) from 6651 to 6791
   goals met: 5 of 20
37. (load-truck package12 truck4 s6)
   deleted: (at package12 s6)
   added: (in package12 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 5 of 20
38. (load-truck package11 truck5 s1)
   deleted: (at package11 s1)
   added: (in package11 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 5 of 20
39. (drive-truck truck5 s1 s12 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s12)
   changed: (fuel-used) from 6791 to 8055
   goals met: 6 of 20
40. (unload-truck package2 truck5 s12)
   deleted: (in package2 truck5)
   added: (at package2 s12)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 7 of 20
41. (load-truck package9 truck1 s5)
   deleted: (at package9 s5)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 20
42. (drive-truck truck4 s6 s7 driver5)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (fuel-used) from 8055 to 8935
   goals met: 7 of 20
43. (load-truck package3 truck4 s7)
   deleted: (at package3 s7)
   added: (in package3 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 7 of 20
44. (load-truck package13 truck4 s7)
   deleted: (at package13 s7)
   added: (in package13 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 7 of 20
45. (drive-truck truck4 s7 s10 driver5)
   deleted: (at truck4 s7)
   added: (at truck4 s10)
   changed: (fuel-used) from 8935 to 10183
   goals met: 7 of 20
46. (drive-truck truck1 s5 s9 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s9)
   changed: (fuel-used) from 10183 to 10196
   goals met: 7 of 20
47. (drive-truck truck4 s10 s2 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s2)
   changed: (fuel-used) from 10196 to 11636
   goals met: 7 of 20
48. (load-truck package7 truck5 s12)
   deleted: (at package7 s12)
   added: (in package7 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 7 of 20
49. (drive-truck truck5 s12 s11 driver3)
   deleted: (at truck5 s12)
   added: (at truck5 s11)
   changed: (fuel-used) from 11636 to 12644
   goals met: 6 of 20
50. (drive-truck truck4 s2 s10 driver5)
   deleted: (at truck4 s2)
   added: (at truck4 s10)
   changed: (fuel-used) from 12644 to 14084
   goals met: 6 of 20
51. (drive-truck truck4 s10 s3 driver5)
   deleted: (at truck4 s10)
   added: (at truck4 s3)
   changed: (fuel-used) from 14084 to 15380
   goals met: 6 of 20
52. (unload-truck package3 truck4 s3)
   deleted: (in package3 truck4)
   added: (at package3 s3)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 7 of 20
53. (drive-truck truck1 s9 s8 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 15380 to 15692
   goals met: 8 of 20
54. (unload-truck package9 truck1 s8)
   deleted: (in package9 truck1)
   added: (at package9 s8)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 9 of 20
55. (drive-truck truck1 s8 s9 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s9)
   changed: (fuel-used) from 15692 to 15956
   goals met: 8 of 20
56. (unload-truck package12 truck4 s3)
   deleted: (in package12 truck4)
   added: (at package12 s3)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 9 of 20
57. (drive-truck truck5 s11 s5 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s5)
   changed: (fuel-used) from 15956 to 17012
   goals met: 9 of 20
58. (drive-truck truck1 s9 s7 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s7)
   changed: (fuel-used) from 17012 to 17441
   goals met: 9 of 20
59. (drive-truck truck4 s3 s12 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s12)
   changed: (fuel-used) from 17441 to 18189
   goals met: 9 of 20
60. (drive-truck truck4 s12 s11 driver5)
   deleted: (at truck4 s12)
   added: (at truck4 s11)
   changed: (fuel-used) from 18189 to 18882
   goals met: 10 of 20
61. (unload-truck package13 truck4 s11)
   deleted: (in package13 truck4)
   added: (at package13 s11)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 11 of 20
62. (drive-truck truck5 s5 s2 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   changed: (fuel-used) from 18882 to 19090
   goals met: 11 of 20
63. (unload-truck package7 truck5 s2)
   deleted: (in package7 truck5)
   added: (at package7 s2)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 12 of 20
64. (drive-truck truck5 s2 s10 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s10)
   changed: (fuel-used) from 19090 to 20260
   goals met: 12 of 20
65. (drive-truck truck1 s7 s9 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s9)
   changed: (fuel-used) from 20260 to 20689
   goals met: 12 of 20
66. (drive-truck truck5 s10 s7 driver3)
   deleted: (at truck5 s10)
   added: (at truck5 s7)
   changed: (fuel-used) from 20689 to 21703
   goals met: 12 of 20
67. (unload-truck package15 truck5 s7)
   deleted: (in package15 truck5)
   added: (at package15 s7)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 12 of 20
68. (drive-truck truck5 s7 s6 driver3)
   deleted: (at truck5 s7)
   added: (at truck5 s6)
   changed: (fuel-used) from 21703 to 22583
   goals met: 12 of 20
69. (unload-truck package11 truck5 s6)
   deleted: (in package11 truck5)
   added: (at package11 s6)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 13 of 20
70. (drive-truck truck5 s6 s12 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s12)
   changed: (fuel-used) from 22583 to 23173
   goals met: 14 of 20
71. (drive-truck truck5 s12 s11 driver3)
   deleted: (at truck5 s12)
   added: (at truck5 s11)
   changed: (fuel-used) from 23173 to 23803
   goals met: 13 of 20
72. (disembark-truck driver3 truck5 s11)
   deleted: (driving driver3 truck5)
   added: (at driver3 s11) (empty truck5)
   goals met: 13 of 20
73. (disembark-truck driver5 truck4 s11)
   deleted: (driving driver5 truck4)
   added: (at driver5 s11) (empty truck4)
   goals met: 13 of 20
74. (walk driver3 s11 p8-11)
   deleted: (at driver3 s11)
   added: (at driver3 p8-11)
   goals met: 13 of 20
75. (walk driver3 p8-11 s8)
   deleted: (at driver3 p8-11)
   added: (at driver3 s8)
   goals met: 14 of 20
76. (board-truck driver5 truck5 s11)
   deleted: (at driver5 s11) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 14 of 20
77. (drive-truck truck5 s11 s12 driver5)
   deleted: (at truck5 s11)
   added: (at truck5 s12)
   changed: (fuel-used) from 23803 to 24433
   goals met: 15 of 20
78. (drive-truck truck1 s9 s7 driver1)
   deleted: (at truck1 s9)
   added: (at truck1 s7)
   changed: (fuel-used) from 24433 to 24862
   goals met: 15 of 20
79. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 15 of 20
80. (load-truck package15 truck1 s7)
   deleted: (at package15 s7)
   added: (in package15 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 15 of 20
81. (drive-truck truck2 s5 s9 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s9)
   changed: (fuel-used) from 24862 to 24872
   goals met: 15 of 20
82. (drive-truck truck2 s9 s1 driver4)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   changed: (fuel-used) from 24872 to 25842
   goals met: 15 of 20
83. (drive-truck truck1 s7 s10 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (fuel-used) from 25842 to 26856
   goals met: 15 of 20
84. (drive-truck truck1 s10 s4 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s4)
   changed: (fuel-used) from 26856 to 27779
   goals met: 15 of 20
85. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 16 of 20
86. (unload-truck package15 truck1 s4)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 17 of 20
87. (drive-truck truck1 s4 s10 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s10)
   changed: (fuel-used) from 27779 to 28489
   goals met: 17 of 20
88. (drive-truck truck1 s10 s12 driver1)
   deleted: (at truck1 s10)
   added: (at truck1 s12)
   changed: (fuel-used) from 28489 to 29079
   goals met: 17 of 20
89. (drive-truck truck1 s12 s3 driver1)
   deleted: (at truck1 s12)
   added: (at truck1 s3)
   changed: (fuel-used) from 29079 to 29759
   goals met: 17 of 20
90. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 17 of 20
91. (walk driver1 s3 p7-3)
   deleted: (at driver1 s3)
   added: (at driver1 p7-3)
   goals met: 17 of 20
92. (drive-truck truck5 s12 s3 driver5)
   deleted: (at truck5 s12)
   added: (at truck5 s3)
   changed: (fuel-used) from 29759 to 30439
   goals met: 16 of 20
93. (walk driver1 p7-3 s7)
   deleted: (at driver1 p7-3)
   added: (at driver1 s7)
   goals met: 17 of 20
94. (disembark-truck driver5 truck5 s3)
   deleted: (driving driver5 truck5)
   added: (at driver5 s3) (empty truck5)
   goals met: 17 of 20
95. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 17 of 20
96. (drive-truck truck1 s3 s9 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 30439 to 30899
   goals met: 17 of 20
97. (drive-truck truck1 s9 s8 driver5)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 30899 to 31139
   goals met: 18 of 20
98. (walk driver1 s7 p7-3)
   deleted: (at driver1 s7)
   added: (at driver1 p7-3)
   goals met: 17 of 20
99. (walk driver1 p7-3 s3)
   deleted: (at driver1 p7-3)
   added: (at driver1 s3)
   goals met: 17 of 20
100. (board-truck driver1 truck5 s3)
   deleted: (at driver1 s3) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 17 of 20
101. (drive-truck truck5 s3 s12 driver1)
   deleted: (at truck5 s3)
   added: (at truck5 s12)
   changed: (fuel-used) from 31139 to 31819
   goals met: 18 of 20
102. (disembark-truck driver1 truck5 s12)
   deleted: (driving driver1 truck5)
   added: (at driver1 s12) (empty truck5)
   goals met: 18 of 20
103. (drive-truck truck2 s1 s7 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 31819 to 32759
   goals met: 18 of 20
104. (board-truck driver2 truck5 s12)
   deleted: (at driver2 s12) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 18 of 20
105. (drive-truck truck2 s7 s1 driver4)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 32759 to 33699
   goals met: 18 of 20
106. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 19 of 20
107. (drive-truck truck5 s12 s6 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s6)
   changed: (fuel-used) from 33699 to 34289
   goals met: 18 of 20
108. (drive-truck truck5 s6 s7 driver2)
   deleted: (at truck5 s6)
   added: (at truck5 s7)
   changed: (fuel-used) from 34289 to 35089
   goals met: 18 of 20
109. (drive-truck truck5 s7 s11 driver2)
   deleted: (at truck5 s7)
   added: (at truck5 s11)
   changed: (fuel-used) from 35089 to 35639
   goals met: 18 of 20
110. (disembark-truck driver2 truck5 s11)
   deleted: (driving driver2 truck5)
   added: (at driver2 s11) (empty truck5)
   goals met: 18 of 20
111. (walk driver1 s12 p5-12)
   deleted: (at driver1 s12)
   added: (at driver1 p5-12)
   goals met: 18 of 20
112. (board-truck driver2 truck5 s11)
   deleted: (at driver2 s11) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 18 of 20
113. (walk driver1 p5-12 s5)
   deleted: (at driver1 p5-12)
   added: (at driver1 s5)
   goals met: 18 of 20
114. (drive-truck truck5 s11 s12 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s12)
   changed: (fuel-used) from 35639 to 36269
   goals met: 19 of 20
115. (walk driver1 s5 p5-4)
   deleted: (at driver1 s5)
   added: (at driver1 p5-4)
   goals met: 19 of 20
116. (walk driver1 p5-4 s4)
   deleted: (at driver1 p5-4)
   added: (at driver1 s4)
   goals met: 19 of 20
117. (walk driver1 s4 p4-7)
   deleted: (at driver1 s4)
   added: (at driver1 p4-7)
   goals met: 19 of 20
118. (walk driver1 p4-7 s7)
   deleted: (at driver1 p4-7)
   added: (at driver1 s7)
   goals met: 20 of 20
